IDEA StatiCa Open Model
ConcreteSetupEc2 Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Concrete setup Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Concrete.ConcreteSetup
 IdeaRS.OpenModel.Concrete.ConcreteSetupEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConcreteSetupEc2 : ConcreteSetup
Public Class ConcreteSetupEc2
	Inherits ConcreteSetup
public ref class ConcreteSetupEc2 : public ConcreteSetup
The ConcreteSetupEc2 type exposes the following members.
Constructors
Name | Description
ConcreteSetupEc2
Initializes a new instance of the ConcreteSetupEc2 class
Top
Properties
Name | Description
Annex
 Annex code
Id
 Element Id
 (Inherited from OpenElementId.)
Nad
 Nad strategy
SetupValues
 Setup values
 (Inherited from ConcreteSetup.)
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace